<template>
  <div>
    <h2>我的笔记</h2><hr>
    <div class="note-content">
      <p style='white-space: pre-line'>{{content}}</p>
    </div>

  </div>
</template>

<script>
export default {
  name: 'NoteMain',
  data () {
    return {
      content: '本集主要改编自原作中的地狱变之卷，并包含了一部分鲭目之卷内容\n' +
        '1.最大的改编是将原作中不知道魔魔蛾存在的村民改为知道其存在，并且将寺庙的孩子们献祭给魔魔蛾\n' +
        '2.删去了鲭目大人对魔魔蛾的一番表白\n' +
        '3.删去了鲭目大人在魔魔蛾的要求下在茶水中给百鬼丸下毒的情节\n' +
        '4.增加了鲭目大人关于自己与魔魔蛾结为夫妻的原因的独白\n' +
        '5.删去了百鬼丸中毒后的一部分剧情（包含有多罗罗救了百鬼丸的情节）\n' +
        '6.增加了百鬼丸反复强调要杀魔神的情节\n' +
        '7.原作中百鬼丸在此卷取回的器官为右腿\n' +
        '8.增加了杀死魔魔蛾以后百多两人冲突的情节\n' +
        '9.增加了多宝丸，地鼠等人出现的情节\n' +
        '10.改写了鲭目大人的结局，原作中鲭目大人剃发为僧，遁入空门\n' +
        '11.第二大改编为本卷结尾百多两人的分开，两人分开的剧情发生在白面不动之卷\n' +
        '关于魔魔蛾武力值比较低的问题：\n' +
        '原作中魔魔蛾的死因主要为「火光会吸引魔魔蛾」（番剧很可能是希望保留此设定），并且不是百鬼丸一人前往湖中斩杀魔魔蛾。\n' +
        '以下内容包含剧透，请注意规避～\n' +
        '原作中关于分开这部分剧情的描写\n' +
        '白面不动之卷：\n' +
        '百：喂，多罗罗，我突然不想跟你在一起了\n' +
        '多：什么？！\n' +
        '百：我们缘分尽啦！你爱去哪就去哪吧。\n' +
        '多：大哥哥……\n' +
        '本卷：\n' +
        '多：喂！大哥哥……我们要去哪里呀？你可别丢下我哦\n' +
        '百：我怎么会。多罗罗，这次还得靠你走在我前面呢。带我去藏宝的地方……'
    }
  }
}
</script>

<style scoped>
  hr {
    width: 90%;
  }

  h2{
    padding-left: 50px;
  }

</style>
